Configuration/Catalogs/бит_ум_ВидыОформляемыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ум_ВидыОформляемыхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Comment>(служебный)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ВидыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийМакетИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийМакетХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/Catalogs/бит_ум_ВидыОформляемыхДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов.
//
// Возвращаемое значение:
//   Массив - список имен реквизитов объекта.
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	НеРедактируемыеРеквизиты.Добавить("*");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

// Возвращает список возможных дополнительных настроек для вида оформляемого документа.
//
// Параметры:
//   ВидОформляемогоДокумента - СправочникСсылка.бит_ум_ВидыОформляемыхДокументов
//     - вид оформляемого документа, для которого нужно получить настройки.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками:
//     * Настройка - ПланВидовХарактеристикСсылка.бит_ум_НастройкиДействий.
//     * НачальноеЗначение - Произвольный - начальное значение настройки.
//
Функция СписокВозможныхНастроек(ВидОформляемогоДокумента) Экспорт
	
	ТаблицаНастроек = Новый ТаблицаЗначений;
	ТаблицаНастроек.Колонки.Добавить("Настройка", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.бит_ум_НастройкиДействий"));
	ТаблицаНастроек.Колонки.Добавить("НачальноеЗначение", Метаданные.ПланыВидовХарактеристик.бит_ум_НастройкиДействий.Тип);
	
	РеквизитыФормы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидОформляемогоДокумента, "ИмяМакета, ВнешнийМакетИспользовать");
	Если РеквизитыФормы.ВнешнийМакетИспользовать Тогда
		Возврат ТаблицаНастроек;
	КонецЕсли;
	
	ДополнительныеНастройкиФормXML = Справочники.бит_ум_ВидыОформляемыхДокументов.ПолучитьМакет("ДополнительныеНастройкиФорм").ПолучитьТекст();
	ДополнительныеНастройкиФорм = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ДополнительныеНастройкиФормXML).Данные;
	
	НайденныеСтроки = ДополнительныеНастройкиФорм.НайтиСтроки(Новый Структура("ИмяМакета", РеквизитыФормы.ИмяМакета));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		СтрокаТЗ = ТаблицаНастроек.Добавить();
		СтрокаТЗ.Настройка = ПланыВидовХарактеристик.бит_ум_НастройкиДействий[НайденнаяСтрока.Настройка];
		СтрокаТЗ.НачальноеЗначение = СтрокаТЗ.Настройка.ТипЗначения.ПривестиЗначение(НайденнаяСтрока.НачальноеЗначение);
	КонецЦикла;
	
	Возврат ТаблицаНастроек;	
	
КонецФункции

#КонецОбласти	
	
#Область ОбработчикиСобытий	

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") И НЕ Параметры.Ключ.ВнешнийМакетИспользовать Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Параметры.Вставить("ИмяОбъектаМетаданныхМакета", "Справочник.бит_ум_ВидыОформляемыхДокументов.ПФ_MXL_" + Параметры.Ключ.ИмяМакета);
		Параметры.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Параметры.Вставить("ИмяДокумента", Параметры.Ключ.Наименование);
		Параметры.Вставить("ТипМакета", "MXL");
		Параметры.Вставить("Редактирование", Истина);
	
		ВыбраннаяФорма = "ОбщаяФорма.РедактированиеТабличногоДокумента";
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
// Процедура выполняет первоначальное заполнение видов оформляемых документов.
//
Процедура НачальноеЗаполнение() Экспорт
	
	КлассификаторТаблица = ТаблицаКлассификатора();
	Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		ЭлементСправочникаПоОписанию(СтрокаКлассификатора);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЭлементСправочникаПоОписанию(СтрокаКлассификатора)
	
	ГруппаСсылка = ПоискЭлементаПоРеквизитам(СтрокаКлассификатора.Группа, , Истина);
	           
	Если НЕ ЗначениеЗаполнено(ГруппаСсылка) Тогда
		ГруппаОбъект = Справочники.бит_ум_ВидыОформляемыхДокументов.СоздатьГруппу();
		ГруппаОбъект.Наименование = СтрокаКлассификатора.Группа;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ГруппаОбъект);
		ГруппаСсылка = ГруппаОбъект.Ссылка;
	КонецЕсли;
	
	Наименование = Метаданные.Справочники.бит_ум_ВидыОформляемыхДокументов.Макеты["ПФ_MXL_" + СтрокаКлассификатора.ИмяМакета].Синоним;
	
	ЭлементСсылка = ПоискЭлементаПоРеквизитам(Наименование, СтрокаКлассификатора.ИмяМакета);
		
	Если НЕ ЗначениеЗаполнено(ЭлементСсылка) Тогда
		ЭлементОбъект = Справочники.бит_ум_ВидыОформляемыхДокументов.СоздатьЭлемент();
		ЭлементОбъект.ИмяМакета = СтрокаКлассификатора.ИмяМакета;
	Иначе
		ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЭлементОбъект.Родитель = ГруппаСсылка;
	ЭлементОбъект.Наименование = Наименование;
	ЭлементОбъект.ДатаНачалаДействия = ПолучитьДату(СтрокаКлассификатора.ДатаНачалаДействия);
	ЭлементОбъект.ДатаОкончанияДействия = ПолучитьДату(СтрокаКлассификатора.ДатаОкончанияДействия);
	ЭлементОбъект.Описание = СтрокаКлассификатора.Описание;
	ЭлементОбъект.ВидДокумента = ?(ЗначениеЗаполнено(СтрокаКлассификатора.ВидДокумента),
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР." + СтрокаКлассификатора.ВидДокумента),
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР.ПустаяСсылка"));
	ЭлементОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭлементОбъект);  
	
КонецПроцедуры

Функция ТаблицаКлассификатора()
	
	КлассификаторXML = Справочники.бит_ум_ВидыОформляемыхДокументов.ПолучитьМакет("ВидыОформляемыхДокументов").ПолучитьТекст();
	Возврат ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
КонецФункции

Функция ПоискЭлементаПоРеквизитам(Наименование, ИмяМакета = "", ЭтоГруппа = Ложь)

	Если ЭтоГруппа Тогда

		НайденнаяГруппа = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоНаименованию(Наименование, Истина);

		Если ЗначениеЗаполнено(НайденнаяГруппа) Тогда
			Возврат НайденнаяГруппа;
		КонецЕсли;

	Иначе
		
		НайденныйЭлемент = Справочники.бит_ум_ВидыОформляемыхДокументов.НайтиПоРеквизиту("ИмяМакета", ИмяМакета);
		
		Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
			Возврат НайденныйЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ПолучитьДату(Значение)

	Если НЕ ЗначениеЗаполнено(Значение) ИЛИ СтрДлина(Значение) <> 10 Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат Дата(Прав(Значение, 4), Сред(Значение, 4, 2), Лев(Значение, 2));
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
